# Concatenating Data using datasets

## Importing pandas

In [1]:
import pandas as pd

## Loading Datasets

In [3]:
marketing_sample1 = pd.read_csv('Data/marketing_campaign_concat1.csv')
marketing_sample2 = pd.read_csv('Data/marketing_campaign_concat2.csv')

In [4]:
marketing_sample1.head(10).T

,0,1,2,3,4,5,6,7,8,9
ID,5524,2174,4141,6182,5324,7446,965,6177,4855,5899
Year_Birth,1957,1954,1965,1984,1981,1967,1971,1985,1974,1950
Education,Graduation,Graduation,Graduation,Graduation,PhD,Master,Graduation,PhD,PhD,PhD
Marital_Status,Single,Single,Together,Together,Married,Together,Divorced,Married,Together,Together
Income,58138.0,46344.0,71613.0,26646.0,58293.0,62513.0,55635.0,33454.0,30351.0,5648.0

In [5]:
marketing_sample2.tail(10).T

,2230,2231,2232,2233,2234,2235,2236,2237,2238,2239
NumDealsPurchases,3,2,1,4,1,2,7,1,2,3
NumWebPurchases,3,9,0,3,1,9,8,2,6,3
NumCatalogPurchases,1,4,0,1,0,3,2,3,5,1
NumStorePurchases,2,12,3,3,2,4,5,13,10,4
NumWebVisitsMonth,9,8,4,6,7,5,7,6,3,7

In [6]:
marketing_sample1.shape

(2240, 5)

In [7]:
marketing_sample2.shape

(2240, 5)

In [8]:
marketing_sample1.dtypes

ID                  int64
Year_Birth          int64
Education          object
Marital_Status     object
Income            float64
dtype: object

In [9]:
marketing_sample2.dtypes

NumDealsPurchases      int64
NumWebPurchases        int64
NumCatalogPurchases    int64
NumStorePurchases      int64
NumWebVisitsMonth      int64
dtype: object

## Concatenating datasets using concat using axis 1 to combine columns method

In [14]:
concatenated_data = pd.concat([marketing_sample1, marketing_sample2], axis = 1)

In [15]:
concatenated_data.head(10).T

,0,1,2,3,4,5,6,7,8,9
ID,5524,2174,4141,6182,5324,7446,965,6177,4855,5899
Year_Birth,1957,1954,1965,1984,1981,1967,1971,1985,1974,1950
Education,Graduation,Graduation,Graduation,Graduation,PhD,Master,Graduation,PhD,PhD,PhD
Marital_Status,Single,Single,Together,Together,Married,Together,Divorced,Married,Together,Together
Income,58138.0,46344.0,71613.0,26646.0,58293.0,62513.0,55635.0,33454.0,30351.0,5648.0
NumDealsPurchases,3,2,1,2,5,2,4,2,1,1
NumWebPurchases,8,1,8,2,5,6,7,4,3,1
NumCatalogPurchases,10,1,2,0,3,4,3,0,0,0
NumStorePurchases,4,2,10,4,6,10,7,4,2,0
NumWebVisitsMonth,7,5,4,6,5,6,6,8,9,20

In [16]:
concatenated_data.shape

(2240, 10)